; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	image1 - mode
	infrared2 - mode
	image3 - mode
	spectrograph0 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 image1)
	(supports instrument1 image3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
)
(:goal (and
	(have_image Phenomenon5 infrared2)
	(have_image Star6 image1)
	(have_image Planet7 spectrograph0)
	(have_image Star8 image3)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 infrared2)
	(have_image Star11 infrared2)
))

)

; plan
1. (turn_to satellite2 groundstation4 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 7
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite2 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite2 phenomenon9 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 7
5. (take_image satellite2 phenomenon9 instrument2 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon5 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon5)
   goals met: 1 of 7
7. (turn_to satellite0 groundstation3 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 7
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
9. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 7
10. (take_image satellite2 phenomenon5 instrument2 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 2 of 7
11. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 2 of 7
12. (take_image satellite0 star8 instrument0 image3)
   added: (have_image star8 image3)
   goals met: 3 of 7
13. (turn_to satellite2 planet7 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet7)
   goals met: 3 of 7
14. (take_image satellite2 planet7 instrument2 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 4 of 7
15. (turn_to satellite2 star10 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star10)
   goals met: 4 of 7
16. (take_image satellite2 star10 instrument2 infrared2)
   added: (have_image star10 infrared2)
   goals met: 5 of 7
17. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 5 of 7
18. (take_image satellite2 star11 instrument2 infrared2)
   added: (have_image star11 infrared2)
   goals met: 6 of 7
19. (turn_to satellite2 star6 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star6)
   goals met: 6 of 7
20. (take_image satellite2 star6 instrument2 image1)
   added: (have_image star6 image1)
   goals met: 7 of 7
